Revit 2027 API
ElementArray.Append Method
Add the element to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Element item
)
Public Overridable Sub Append (
	item As Element
)
public:
virtual void Append(
	Element^ item
)
abstract Append :
        item : Element -> unit
override Append :
        item : Element -> unit
Parameters
item Element
The element to be added.
See Also
Reference
ElementArray Class
Autodesk.Revit.DB Namespace